app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.allRatings

   if(params[:ratings] == nil && params[:order] == nil && (session[:ratings] != nil || session[:order] != nil))
	if(params[:ratings] == nil && session[:ratings] != nil)
	    params[:ratings] = session[:ratings]
	end
	if(params[:order] == nil && session[:order] != nil)
	    params[:order] = session[:order]
	end
	flash.keep
	redirect_to movies_path(:order => params[:order], :ratings => params[:ratings])

    elsif (params[:commit] != nil)
	if(params[:order] == nil && session[:order] != nil)
	    params[:order] = session[:order]
	end
	redirect_to movies_path(:order => params[:order], :ratings => params[:ratings])

    else
	session[:order] = params[:order]
    	session[:ratings] = params[:ratings]
	@curr_ratings = params[:ratings]? params[:ratings].keys : []

    	@movies = Movie.find(:all, :conditions => {:rating => (@curr_ratings==[]? @all_ratings : @curr_ratings)})
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1'