app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @all_ratings = Movie.allRatings

    if(params[:order] == "title")
    	@movies = Movie.find(:all, :order => "title")
    elsif(params[:order] == "release_date")
    	@movies = Movie.find(:all, :order => "release_date")
    else
	@movies = Movie.all